/*

А можно для курсового проекта разработать собственную базу данных? У меня уже давно витает идея сделать приложение для аренды футбольных площадок 
(сам люблю поиграть в футбол). Очень часто бывают сложности с арендой и набором людей на игру, какие-то команды заранее арендуют площадки и потом не могут 
найти людей на ней поиграть, кто-то наборот готов поиграть, но все площадки заняты. Приложение должно будет позврлять передавать свои права 
на поиграть другим командам или быстро находить соперников, если своих игроков хватает только на одну команду. Подойдет такая задача для курсового проекта?     

*/